scripts/ch4/ch4-ftp.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="2.6" jmeter="2.11 r1554548">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">3</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1399847575000</longProp>
        <longProp name="ThreadGroup.end_time">1399847575000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <org.apache.jmeter.protocol.ssh.sampler.SSHSFTPSampler guiclass="TestBeanGUI" testclass="org.apache.jmeter.protocol.ssh.sampler.SSHSFTPSampler" testname="SSH SFTP" enabled="true">
          <stringProp name="action">put</stringProp>
          <intProp name="connectionTimeout">5000</intProp>
          <stringProp name="destination">${dest}</stringProp>
          <stringProp name="hostname">${host}</stringProp>
          <stringProp name="password">${password}</stringProp>
          <intProp name="port">22</intProp>
          <boolProp name="printFile">true</boolProp>
          <stringProp name="source">${src}</stringProp>
          <stringProp name="username">${user}</stringProp>
        </org.apache.jmeter.protocol.ssh.sampler.SSHSFTPSampler>
        <hashTree/>
        <org.apache.jmeter.protocol.ssh.sampler.SSHSFTPSampler guiclass="TestBeanGUI" testclass="org.apache.jmeter.protocol.ssh.sampler.SSHSFTPSampler" testname="SSH SFTP" enabled="false">
          <stringProp name="action">ls</stringProp>
          <intProp name="connectionTimeout">5000</intProp>
          <stringProp name="hostname">${host}</stringProp>
          <stringProp name="password">${password}</stringProp>
          <intProp name="port">22</intProp>
          <boolProp name="printFile">true</boolProp>
          <stringProp name="source">/</stringProp>
          <stringProp name="username">${user}</stringProp>
        </org.apache.jmeter.protocol.ssh.sampler.SSHSFTPSampler>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="filename">sftp-files.txt</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
        </CSVDataSet>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
          <stringProp name="delimiter">,</stringProp>
          <stringProp name="filename">sftp.txt</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
          <boolProp name="stopThread">false</boolProp>
        </CSVDataSet>
        <hashTree/>
        <FTPSampler guiclass="FtpTestSamplerGui" testclass="FTPSampler" testname="FTP Request" enabled="false">
          <stringProp name="FTPSampler.server">${host}</stringProp>
          <stringProp name="FTPSampler.filename">/tmp/ftpuser/files/ftp-test.txt</stringProp>
          <stringProp name="FTPSampler.localfilename">/tmp/b.txt</stringProp>
          <boolProp name="FTPSampler.binarymode">false</boolProp>
          <boolProp name="FTPSampler.saveresponse">false</boolProp>
          <boolProp name="FTPSampler.upload">true</boolProp>
          <stringProp name="ConfigTestElement.username">root</stringProp>
          <stringProp name="ConfigTestElement.password">tyymizbmeztp</stringProp>
        </FTPSampler>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>